In [1]:
md1={'Bank':'SBI','Branch':'MGRoad',91:'India',91.5:'PAkistan'}

In [2]:
print(type(md1))

<class 'dict'>

In [3]:
md1[0]

KeyError: 0

In [4]:
md1['Branch']

'MGRoad'

In [5]:
md1[91]

'India'

In [6]:
md1[91] = 'Korea'

In [7]:
md1

{'Bank': 'SBI', 'Branch': 'MGRoad', 91: 'Korea', 91.5: 'PAkistan'}

In [8]:
md1['Branch'] = 'Market'

In [9]:
md1

{'Bank': 'SBI', 'Branch': 'Market', 91: 'Korea', 91.5: 'PAkistan'}

In [10]:
md2 = {'Bank': 'SBI', 'Branch': 'MGRoad', 91:'India', 'Branch': 'Market'}
print(md2)

{'Bank': 'SBI', 'Branch': 'Market', 91: 'India'}

In [11]:
md2 = {'Bank': 'SBI', 'Branch': 'Blr', 91:'India', 'Branch': 'Del', 'City': 'Del'}
print(md2)

{'Bank': 'SBI', 'Branch': 'Del', 91: 'India', 'City': 'Del'}

In [8]:
 import pandas as pd
import numpy as np

In [9]:
myList1=[11,22,33,44,55,'hello']
ps1 = pd.Series(myList1)
print(type(ps1))
print(ps1.index)
print(ps1.ndim)
print(ps1.shape)
print(ps1.dtype)

<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=6, step=1)
1
(6,)
object

In [13]:
myList1=[11,22,33,44,55]
ps1 = pd.Series(myList1,dtype=np.float32)
print(ps1)
print(type(ps1))
print(ps1.index)
print(ps1.ndim)
print(ps1.shape)
print(ps1.dtype)

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
dtype: float32
<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=5, step=1)
1
(5,)
float32

In [15]:
row_index_List=['Birla', 'Infy', 'Wipro', 'HCL','Tata','Tata']
myList1 = [200,300,400,500,100,50]
ps2 = pd.Series(myList1,row_index_List)
print(ps2)
print(ps2.index)

Birla    200
Infy     300
Wipro    400
HCL      500
Tata     100
Tata      50
dtype: int64
Index(['Birla', 'Infy', 'Wipro', 'HCL', 'Tata', 'Tata'], dtype='object')

In [17]:
ps2[0]

200

In [18]:
ps2['Tata']

Tata    100
Tata     50
dtype: int64

In [20]:
md1 = {'Tata': 100, 'Birla':200, 'Wipro':300, 'Infy':400, 'HCL':500, 'TCS':350}
ps3 = pd.Series(md1)
print(ps3)
print(ps3.index)

Tata     100
Birla    200
Wipro    300
Infy     400
HCL      500
TCS      350
dtype: int64
Index(['Tata', 'Birla', 'Wipro', 'Infy', 'HCL', 'TCS'], dtype='object')

In [21]:
ps3['Tata']

100

In [22]:
ps3['TCS']

350

In [23]:
ps3.index

Index(['Tata', 'Birla', 'Wipro', 'Infy', 'HCL', 'TCS'], dtype='object')

In [24]:
ps3['Birla':'Infy']

Birla    200
Wipro    300
Infy     400
dtype: int64

In [25]:
ps3[1:3]

Birla    200
Wipro    300
dtype: int64

In [26]:
ps3[['Birla','TCS','Wipro']]

Birla    200
TCS      350
Wipro    300
dtype: int64

In [27]:
ps3[ps3>300]

Infy    400
HCL     500
TCS     350
dtype: int64

In [29]:
ps3[ps3 < 300]

Tata     100
Birla    200
dtype: int64

In [30]:
ps3['Birla']=22

In [31]:
ps3

Tata     100
Birla     22
Wipro    300
Infy     400
HCL      500
TCS      350
dtype: int64

In [32]:
ps3.max()

500

In [33]:
ps3.min()

22

In [34]:
ps3.count()

6

In [35]:
ps3.value_counts()

350    1
22     1
100    1
500    1
300    1
400    1
dtype: int64

In [37]:
ps3.rename(index={'Tata':'Tata_Sona'})

Tata_Sona    100
Birla         22
Wipro        300
Infy         400
HCL          500
TCS          350
dtype: int64

In [1]:
import pandas as pd

In [6]:
df11 = pd.read_csv('lds11.csv')
df11

                 Vol    Rev  Exp Sector  EmpCnt
Kolkata_FMCG     900  874.4  676    Pub    1379
NCR_Leagles      931  863.5  605    Pub    1935
Bombay_Sporting  925  839.8  615    Pvt     154

In [7]:
df12 = pd.read_csv('lds12.csv')
df12

                   Vol    Rev  Exp Sector   HQ
Bombay_Sporting    925  839.8  615    Pvt  Mum
Bombay_Finance     899  917.0  674    Pub  Mum
Bangalore_Systems  931  881.6  650    Gov  Blr
Chennai_Shipping   992  821.0  665    Pub  Che

In [8]:
dfc = pd.concat(objs=(df11,df12),axis=0,join='outer')
dfc

                   Vol    Rev  Exp Sector  EmpCnt   HQ
Kolkata_FMCG       900  874.4  676    Pub  1379.0  NaN
NCR_Leagles        931  863.5  605    Pub  1935.0  NaN
Bombay_Sporting    925  839.8  615    Pvt   154.0  NaN
Bombay_Sporting    925  839.8  615    Pvt     NaN  Mum
Bombay_Finance     899  917.0  674    Pub     NaN  Mum
Bangalore_Systems  931  881.6  650    Gov     NaN  Blr
Chennai_Shipping   992  821.0  665    Pub     NaN  Che

In [9]:
dfc = pd.concat(objs=(df11,df12),axis=0,join='outer',keys=['df_11','df_12'])
dfc

                         Vol    Rev  Exp Sector  EmpCnt   HQ
df_11 Kolkata_FMCG       900  874.4  676    Pub  1379.0  NaN
      NCR_Leagles        931  863.5  605    Pub  1935.0  NaN
      Bombay_Sporting    925  839.8  615    Pvt   154.0  NaN
df_12 Bombay_Sporting    925  839.8  615    Pvt     NaN  Mum
      Bombay_Finance     899  917.0  674    Pub     NaN  Mum
      Bangalore_Systems  931  881.6  650    Gov     NaN  Blr
      Chennai_Shipping   992  821.0  665    Pub     NaN  Che

In [10]:
dfc.index

MultiIndex([('df_11',      'Kolkata_FMCG'),
            ('df_11',       'NCR_Leagles'),
            ('df_11',   'Bombay_Sporting'),
            ('df_12',   'Bombay_Sporting'),
            ('df_12',    'Bombay_Finance'),
            ('df_12', 'Bangalore_Systems'),
            ('df_12',  'Chennai_Shipping')],
           )

In [14]:
dfc.loc[('df_11',   'Bombay_Sporting')]

Vol         925
Rev       839.8
Exp         615
Sector      Pvt
EmpCnt      154
HQ          NaN
Name: (df_11, Bombay_Sporting), dtype: object

In [15]:
dfc1 = pd.concat(objs=(df11,df12),axis=1,join='outer',keys=['df_11','df_12'])
dfc1

                   df_11                               df_12                \
                     Vol    Rev    Exp Sector  EmpCnt    Vol    Rev    Exp
Kolkata_FMCG       900.0  874.4  676.0    Pub  1379.0    NaN    NaN    NaN
NCR_Leagles        931.0  863.5  605.0    Pub  1935.0    NaN    NaN    NaN
Bombay_Sporting    925.0  839.8  615.0    Pvt   154.0  925.0  839.8  615.0
Bombay_Finance       NaN    NaN    NaN    NaN     NaN  899.0  917.0  674.0
Bangalore_Systems    NaN    NaN    NaN    NaN     NaN  931.0  881.6  650.0
Chennai_Shipping     NaN    NaN    NaN    NaN     NaN  992.0  821.0  665.0


                  Sector   HQ
Kolkata_FMCG         NaN  NaN
NCR_Leagles          NaN  NaN
Bombay_Sporting      Pvt  Mum
Bombay_Finance       Pub  Mum
Bangalore_Systems    Gov  Blr
Chennai_Shipping     Pub  Che

In [16]:
df11

                 Vol    Rev  Exp Sector  EmpCnt
Kolkata_FMCG     900  874.4  676    Pub    1379
NCR_Leagles      931  863.5  605    Pub    1935
Bombay_Sporting  925  839.8  615    Pvt     154

In [17]:
df12

                   Vol    Rev  Exp Sector   HQ
Bombay_Sporting    925  839.8  615    Pvt  Mum
Bombay_Finance     899  917.0  674    Pub  Mum
Bangalore_Systems  931  881.6  650    Gov  Blr
Chennai_Shipping   992  821.0  665    Pub  Che

In [21]:
dfc1.loc['Kolkata_FMCG']
dfc1.columns

MultiIndex([('df_11',    'Vol'),
            ('df_11',    'Rev'),
            ('df_11',    'Exp'),
            ('df_11', 'Sector'),
            ('df_11', 'EmpCnt'),
            ('df_12',    'Vol'),
            ('df_12',    'Rev'),
            ('df_12',    'Exp'),
            ('df_12', 'Sector'),
            ('df_12',     'HQ')],
           )

In [27]:
dfc1.loc['Kolkata_FMCG'][('df_12','HQ')]

nan

In [25]:
pd.pivot_table(df11,index='Sector',columns='Vol')

        EmpCnt                   Exp                  Rev
Vol        900    925     931    900    925    931    900    925    931
Sector
Pub     1379.0    NaN  1935.0  676.0    NaN  605.0  874.4    NaN  863.5
Pvt        NaN  154.0     NaN    NaN  615.0    NaN    NaN  839.8    NaN

In [3]:
import pandas as pd
import numpy as np

In [4]:
ps1 = pd.Series([1,2,3,4,5])
ps1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
ps2 = pd.Series(np.array([10,20,30,40]))
ps2

0    10
1    20
2    30
3    40
dtype: int32

In [8]:
ps3 = pd.Series(np.array([11,22,33,44,55]),index=np.arange(0,5))
ps3

0    11
1    22
2    33
3    44
4    55
dtype: int32

In [9]:
ps4 = pd.Series(np.array([10,20,30,40]),index=['a','b','c','d'])
ps4

a    10
b    20
c    30
d    40
dtype: int32

In [10]:
mydict={'a' : 10,'b' : '20','c' : 30}
ps5 = pd.Series(mydict)
ps5

a    10
b    20
c    30
dtype: object

In [11]:
ps5.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
ps5.values

array([10, '20', 30], dtype=object)

In [13]:
ps5.value_counts

<bound method IndexOpsMixin.value_counts of a    10
b    20
c    30
dtype: object>

In [14]:
ps5[:2]

a    10
b    20
dtype: object

In [15]:
ps5[-2:]

b    20
c    30
dtype: object

In [16]:
ps5['a']

10

In [18]:
ps5[['a','b','c']]

a    10
b    20
c    30
dtype: object

In [20]:
ps5.multiply(2)

a      20
b    2020
c      60
dtype: object

In [21]:
ps5+ps1

a    NaN
b    NaN
c    NaN
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
dtype: object

In [23]:
salary_list=[['John',10000],['B',20000],['D',10000]]
pd1 = pd.DataFrame(salary_list,index=['a','b','c'],columns=['Name','Salary'])
pd1

   Name  Salary
a  John   10000
b     B   20000
c     D   10000